package com.example.naamjap.chalisa;

import androidx.appcompat.app.AppCompatActivity;
import androidx.cardview.widget.CardView;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;

import com.example.naamjap.R;

public class chalisaSelection extends AppCompatActivity {
    CardView hanuman  , durga ;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_chalisa_selection);
        hanuman = findViewById(R.id.HanumanChalisa);
        durga = findViewById(R.id.DurgaChalisa);
        durga.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                Intent i = new Intent(chalisaSelection.this , chalisa.class);
                i.putExtra("Chalisa" ,"नमो नमो दुर्गे सुख करनी।\n" +
                        "\n" +
                        "नमो नमो अंबे दुख हरनी।।\n" +
                        "\n" +
                        "निरंकार है ज्योति तुम्हारी ।\n" +
                        "\nतिहूं लोक फैली उजियारी।\n" +
                        "\n" +
                        "शशि ललाट मुख महा विशाला ।\n" +
                        "\n" +
                        "नेत्र लाल भृकुटी विकराला ।।\n" +
                        "\n" +
                        "रूप मातु को अधिक सुहावे ।\n" +
                        "\n" +
                        "दरश करत जन अति सुख पावे ।।\n" +
                        "\n" +
                        "तुम संसार शक्ति लय कीन्हा।\n" +
                        "\n" +
                        "पालन हेतु अन्न धन दीन्हा।।\n" +
                        "\n" +
                        "अन्नपूर्णा हुई जग पाला ।\n" +
                        "\n" +
                        "तुम ही आदि सुंदरी बाला ।।\n" +
                        "\n" +
                        "प्रलय काल सब नासन हारी ।\n" +
                        "\n" +
                        "तुम गौरी शिव शंकर प्यारी ।।\n" +
                        "\n" +
                        "शिव जोगी तुम्हारे गुण गावें।\n" +
                        "\n" +
                        "ब्रह्मा विष्णु तुम्हें नित ध्यावे।।\n" +
                        "\n" +
                        "रूप सरस्वती को तुम धारा ।\n" +
                        "\n" +
                        "दे सुबुद्धि ऋषि मुनिन उबारा ।।\n" +
                        "\n" +
                        "धरा रूप नरसिंह को अंबा ।\n" +
                        "\n" +
                        "प्रगट भई फाड़कर खंबा।।\n" +
                        "\n" +
                        "रक्षा करि प्रहलाद बचाओ।\n" +
                        "\n" +
                        "हिरणाकुश को स्वर्ग पठायो ।।\n" +
                        "\n" +
                        "लक्ष्मी रूप धरो जग माहीं ।\n" +
                        "\n" +
                        "श्री नारायण अंग समाहीं ।।\n" +
                        "\n" +
                        "क्षीर सिंधु में करत विलासा ।\n" +
                        "\n" +
                        "दया सिंधु दीजै मन आसा ।।\n" +
                        "\n" +
                        "हिंगलाज में तुम्हीं भवानी।\n" +
                        "\n" +
                        "महिमा अमित ना जाए बखानी ।।\n" +
                        "\n" +
                        "मातंगी धूमावती माता ।\n" +
                        "\n" +
                        "भुवनेश्वरी बगला सुखदाता।।\n" +
                        "\n" +
                        "श्री भैरव तारा जग तारिणी ।\n" +
                        "\n" +
                        "छिन्नभाल भव दुख निवारिणी ।।\n" +
                        "\n" +
                        "केहरी वाहन सोह भवानी ।\n" +
                        "\n" +
                        "लांगुर वीर चलत अगवानी ।।\n" +
                        "\n" +
                        "कर मैं खप्पर खड़क बिराजे ।\n" +
                        "\n" +
                        "जाको देख काल डर भाजै।।\n" +
                        "\n" +
                        "सोहे अस्त्र और त्रिशूला।\n" +
                        "\n" +
                        "जाते उठत शत्रु हिय शूला।।\n" +
                        "\n" +
                        "नगरकोट में तुम्हीं विराजत ।\n" +
                        "\n" +
                        "तिहूं लोक में डंका बाजत ।।\n" +
                        "\n" +
                        "शुंभ निशुंभ दानव तुम मारे।\n" +
                        "\n" +
                        "रक्त बीज संखन सहारे।।\n" +
                        "\n" +
                        "महिषासुर नृप अति अभिमानी।\n" +
                        "\n" +
                        "जेही अघ भार अकुलानी ।।\n" +
                        "\n" +
                        "रूप कराल काली को धारा ।\n" +
                        "\n" +
                        "सेन सहित तुम तिही संहारा।।\n" +
                        "\n" +
                        "परी गाढ़ संतन पर जब जब ।\n" +
                        "\n" +
                        "भई सहाय मातु तुम तब तब ।।\n" +
                        "\n" +
                        "अमर पुरी औरों सब लोका।\n" +
                        "\n" +
                        "तब महिमा सब रहै असोका।।\n" +
                        "\n" +
                        "ज्वाला में है ज्योति तुम्हारी।\n" +
                        "\n" +
                        "तुम्हें सदा पुजें नरनारी।।\n" +
                        "\n" +
                        "प्रेम भक्ति से जो जस गावे ।\n" +
                        "\n" +
                        "दुख दारिद्र निकट नहि आवै ।।\n" +
                        "\n" +
                        "ध्यान तुम्हें जो नर मन लाई ।\n" +
                        "\n" +
                        "जन्म मरन ताको छुटी जाई।।\n" +
                        "\n" +
                        "जोगी सुर मुनि कहत पुकारी ।\n" +
                        "\n" +
                        "जोग न हो बिन सक्ति तुम्हारी ।।\n" +
                        "\n" +
                        "संकर आचाराज तप कीन्हो ।\n" +
                        "\n" +
                        "काम क्रोध जीति सब लीन्हो।।\n" +
                        "\n" +
                        "निसदिन ध्यान धरो शंकर को।\n" +
                        "\n" +
                        "काह काल नहि सुमिरो तुमको ।।\n" +
                        "\n" +
                        "सक्ति रूप को मरम ना पायो।\n" +
                        "\n" +
                        "सक्ति गई तब मन पछीतायो ।।\n" +
                        "\n" +
                        "शरणागत हुई कीर्ति बखानी।\n" +
                        "\n" +
                        "जय जय जय जगदंबा भवानी ।।\n" +
                        "\n" +
                        "भई प्रसन्न आदि जगदंबा ।\n" +
                        "\n" +
                        "दई सक्ति नहि कीन्ह बिलंबा ।।\n" +
                        "\n" +
                        "मोको मातु कष्ट अति घेरो।\n" +
                        "\n" +
                        "तुम बिन कौन हरे दुख मेरो ।।\n" +
                        "\n" +
                        "आसा तृष्णा निपट सतावे।\n" +
                        "\n" +
                        "रिपु मुरख मोहि अति दरपावे।।\n" +
                        "\n" +
                        "शत्रु नास की कीजै महारानी ।\n" +
                        "\n" +
                        "सुमिरों एकचित तुमहिं भवानी ।।\n" +
                        "\n" +
                        "करो कृपा हे मातु दयाला।\n" +
                        "\n" +
                        "रिद्धि सिद्धि दे करहु निहाला।।\n" +
                        "\n" +
                        "जब लगि जीयों दयाफल पाऊं।\n" +
                        "\n" +
                        "तुम्हरो जस में सदा सुनाऊं ।।\n" +
                        "\n" +
                        "दुर्गा चालीसा जो कोई गावे ।\n" +
                        "\n" +
                        "सब सुख भोग परम पद पावे।।\n" +
                        "\n" +
                        "देवीदास शरण निज जानी ।\n" +
                        "\n" +
                        "करहू कृपा जगदंब भवानी ।।");
                startActivity(i);

            }
        });
        hanuman.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                Intent i = new Intent(chalisaSelection.this , chalisa.class);
                i.putExtra("Chalisa" ,"जय हनुमान ज्ञान गुन सागर।\n" +
                        "जय कपीस तिहुं लोक उजागर।।\n" +
                        "रामदूत अतुलित बल धामा।\n" +
                        "अंजनि-पुत्र पवनसुत नामा।।\n" +
                        "\n" +
                        "महावीर विक्रम बजरंगी।\n" +
                        "कुमति निवार सुमति के संगी।।\n" +
                        "कंचन वरन विराज सुवेसा।\n" +
                        "कानन कुण्डल कुंचित केसा।।\n" +
                        "\n" +
                        "हाथ बज्र औ ध्वजा बिराजै।\n" +
                        "काँधे मूँज जनेऊ साजै।\n" +
                        "शंकर सुवन केसरीनंदन।\n" +
                        "तेज प्रताप महा जग वन्दन।।\n" +
                        "\n" +
                        "विद्यावान गुणी अति चातुर।\n" +
                        "राम काज करिबे को आतुर।।\n" +
                        "प्रभु चरित्र सुनिबे को रसिया।\n" +
                        "राम लखन सीता मन बसिया।।\n" +
                        "\n" +
                        "सूक्ष्म रूप धरि सियहिं दिखावा।\n" +
                        "विकट रूप धरि लंक जरावा।।\n" +
                        "भीम रूप धरि असुर संहारे।\n" +
                        "रामचंद्र के काज संवारे।।\n" +
                        "\n" +
                        "लाय सजीवन लखन जियाये।\n" +
                        "श्रीरघुबीर हरषि उर लाये।।\n" +
                        "रघुपति कीन्ही बहुत बड़ाई।\n" +
                        "तुम मम प्रिय भरतहि सम भाई।।\n" +
                        "\n" +
                        "सहस बदन तुम्हरो जस गावैं।\n" +
                        "अस कहि श्रीपति कंठ लगावैं।।\n" +
                        "सनकादिक ब्रह्मादि मुनीशा।\n" +
                        "नारद सारद सहित अहीसा।।\n" +
                        "\n" +
                        "जम कुबेर दिगपाल जहां ते।\n" +
                        "कवि कोविद कहि सके कहाँ ते।।\n" +
                        "तुम उपकार सुग्रीवहिं कीन्हा।\n" +
                        "राम मिलाय राज पद दीन्हा।।\n" +
                        "\n" +
                        "तुम्हरो मंत्र विभीषन माना।\n" +
                        "लंकेश्वर भये सब जग जाना।।\n" +
                        "जुग सहस्र योजन पर भानू।\n" +
                        "लील्यो ताहि मधुर फल जानू।।\n" +
                        "\n" +
                        "प्रभु मुद्रिका मेलि मुख माहीं।\n" +
                        "जलधि लांघि गये अचरज नाहीं।।\n" +
                        "दुर्गम काज जगत के जेते।\n" +
                        "सुगम अनुग्रह तुम्हरे तेते।।\n" +
                        "\n" +
                        "राम दुआरे तुम रखवारे।\n" +
                        "होत न आज्ञा बिनु पैसारे।।\n" +
                        "सब सुख लहै तुम्हारी सरना।\n" +
                        "तुम रक्षक काहू को डरना।।\n" +
                        "\n" +
                        "आपन तेज सम्हारो आपै।\n" +
                        "तीनों लोक हांक तें कांपै।।\n" +
                        "भूत पिसाच निकट नहिं आवै।\n" +
                        "महाबीर जब नाम सुनावै।।\n" +
                        "\n" +
                        "नासै रोग हरै सब पीरा।\n" +
                        "जपत निरंतर हनुमत बीरा।।\n" +
                        "संकट तें हनुमान छुड़ावै।\n" +
                        "मन क्रम वचन ध्यान जो लावै।।\n" +
                        "\n" +
                        "सब पर राम तपस्वी राजा।\n" +
                        "तिनके काज सकल तुम साजा।\n" +
                        "और मनोरथ जो कोई लावै।\n" +
                        "सोई अमित जीवन फल पावै।।\n" +
                        "\n" +
                        "चारों युग परताप तुम्हारा।\n" +
                        "है परसिद्ध जगत उजियारा।।\n" +
                        "साधु-संत के तुम रखवारे।\n" +
                        "असुर निकंदन राम दुलारे।।\n" +
                        "\n" +
                        "अष्ट सिद्धि नौ निधि के दाता।\n" +
                        "अस वर दीन जानकी माता।।\n" +
                        "राम रसायन तुम्हरे पासा।\n" +
                        "सदा रहो रघुपति के दासा।।\n" +
                        "\n" +
                        "तुम्हरे भजन राम को भावै।\n" +
                        "जनम-जनम के दुख बिसरावै।।\n" +
                        "अन्त काल रघुबर पुर जाई।\n" +
                        "जहाँ जन्म हरि-भक्त कहाई।।\n" +
                        "\n" +
                        "और देवता चित्त न धरई।\n" +
                        "हनुमत सेई सर्व सुख करई।।\n" +
                        "संकट कटै मिटै सब पीरा।\n" +
                        "जो सुमिरै हनुमत बलबीरा।।\n" +
                        "\n" +
                        "जै जै जै हनुमान गोसाईं।\n" +
                        "कृपा करहु गुरुदेव की नाईं।।\n" +
                        "जो सत बार पाठ कर कोई।\n" +
                        "छूटहिं बंदि महा सुख होई।।\n" +
                        "\n" +
                        "जो यह पढ़ै हनुमान चालीसा।\n" +
                        "होय सिद्धि साखी गौरीसा।।\n" +
                        "तुलसीदास सदा हरि चेरा।\n" +
                        "कीजै नाथ हृदय महँ डेरा।।");
                startActivity(i);
            }
        });
    }
}